# Градинар продавал реколтата от градината си на зеленчуковата борса. Продава зеленчуци за N лева на килограм и
# плодове за M лева за килограм. Напишете програма, която да пресмята приходите от реколтата в евро
# ( ако приемем, че едно евро е равно на 1.94лв).
#
# Вход
# От конзолата се четат 4 числа, по едно на ред:
# •	Първи ред – Цена за килограм зеленчуци – реално число[0.00… 1000.00]
# •	Втори ред – Цена за килограм плодове – реално число[0.00… 1000.00]
# •	Трети ред – Общо килограми на зеленчуците – цяло число[0… 1000]
# •	Четвърти ред – Общо килограми на плодовете – цяло число[0… 1000]

price_veg = float(input())
price_fruits = float(input())
kg_veg = float(input())
kg_fruits = float(input())
total_bgl = price_veg * kg_veg + price_fruits * kg_fruits
eur_bgl_exch = 1.94
total_eur = total_bgl / eur_bgl_exch
print(f'{total_eur:.2f}')