# Учебна зала има правоъгълен размер w на h метра, без колони във вътрешността си.
# Залата е разделена на две части – лява и дясна, с коридор приблизително по средата.
# В лявата и в дясната част има редици с бюра. В задната част на залата има голяма входна врата.
# В предната част на залата има катедра с подиум за преподавателя.
# Едно работно място заема 70 на 120 cm (маса с размер 70 на 40 cm + място за стол и преминаване с размер 70 на 80 cm).
# Коридорът е широк поне 100 cm. Изчислено е, че заради входната врата (която е с отвор 160 cm) се губи точно 1 работно място,
# а заради катедрата (която е с размер 160 на 120 cm) се губят точно 2 работни места.
#
# # Напишете програма, която въвежда размери на учебната зала и изчислява броя работни места в нея при описаното разположение (вж. фигурата).
# Вход
# От конзолата се четат 2 числа, по едно на ред: w (дължина в метри) и h (широчина в метри).
# Ограничения: 3 ≤ h ≤ w ≤ 100.
# Изход
# Да се отпечата на конзолата едно цяло число: броят места в учебната зала.
#
# Вход	  Изход
# 15
# 8.9	   129
# 8.4
# 5.2	   39

w = float(input())
h = float(input())
room_limit = 3 <= h <= w <= 100
room_size = w * h
desk_reduction_door = 1
desk_reduction_teacher = 2
patway_h = 1
desk_h = 0.7
desk_w = 1.2

desk_h_space = h - patway_h
desk_per_row = desk_h_space // desk_h
desk_rows = w // desk_w
desks = desk_per_row * desk_rows
total_desks = desk_per_row * desk_rows - (desk_reduction_door + desk_reduction_teacher)

if room_limit == True:
    print(desk_per_row)
    print(desk_rows)
    print(desks)
    print(total_desks)

# Това е вярната задача спред SoftUni
